#include <bits/stdc++.h>
using namespace std;
int32_t main() {
    // n = 24:
    // 1 2 3 ... 24 1 2 3 ... 24 1 2 3 ... 24 1 2 3 ... 24
    // 25 + 25
    // n = 25: 1 2 3 ... 25 1 2 3 ... 25
    // тоже 50
    // n = 26: 1 2 3 ... 25 26 1 2 3 ... 26
    // 51
    int n; cin >> n;
    int minN = 50 + max(0, n - 25);
    // n = 24:
    // 1 1 1 1 1 .... 1 1 1 1 2 2 2 2 .... 2
    // 25 - первая квота
    // 25 - вторая квота
    // затем лучшие команды вузов
    // какая-то линейная функция, при n = 27 будет 76 = 50 + (n-1)
    int maxN = 50 + (n-1);
    cout << minN << ' ' << maxN << endl;
}
