#include <bits/stdc++.h>
using namespace std;
main() {
    string s, t; cin >> s >> t;
    int n00{}, n10{}, n11{}, n01{};
    for (int i = 0; i < (int)s.size(); i++) {
        n00 += (s[i] == '.' && t[i] == '.');
        n01 += (s[i] == '.' && t[i] == '#');
        n10 += (s[i] == '#' && t[i] == '.');
        n11 += (s[i] == '#' && t[i] == '#');
    }
    // нельзя, если единичные клетки вверху и внизу не сможем соединить двойками:
    if (n01 > 0 && n10 > 0 && n11 == 0)
        cout << "NO\n";
    else {
        // ставим сначала пустые, потом 01, потом 11, потом 10
        cout << "YES\n";
        s.clear();
        t.clear();
        while (n00 --> 0) {
            s += '.';
            t += '.';
        }
        while (n01 --> 0) {
            s += '.';
            t += '#';
        }
        while (n11 --> 0) {
            s += '#';
            t += '#';
        }
        while (n10 --> 0) {
            s += '#';
            t += '.';
        }
        cout << s << "\n" << t << "\n";
    }
}
