## 6. Скользящее окно внутри бинарного поиска

В предыдущей части длина окна $k$ была уже дана. Теперь перейдём к следующему типу задач: длину нужно не использовать, а найти.

Очень часто (почти всегда) задача спрашивает не ответ для одного фиксированного $k$, а **максимальное** или **минимальное** значение длины.

Здесь одного скользящего окна уже недостаточно. Оно хорошо отвечает на вопрос “что происходит при фиксированном $k$?”, но не выбирает $k$ само. Поэтому типичный маршрут рассуждения выглядит так:

- существует ли подходящий подотрезок длины ровно $k$;
- найдите максимальное $k$, для которого такой подотрезок существует.

В таких случаях сперва проверяют монотонность: если подходящий подотрезок длины $k$ существует, то подходящий подотрезок длины $k - 1$ тоже существует? А если подходящего подотрезка длины $k$ не существует, то подходящего подотрезка длины $k + 1$ уж точно не существует, да? Если да, тогда появляется стандартная схема:

1. бинарным поиском перебираем длину $k$;
2. для фиксированного $k$ запускаем быструю проверку;
3. внутри этой проверки часто и живёт скользящее окно длины ровно $k$.

То есть роли здесь строго разделены: скользящее окно отвечает за быстрый проход по всем окнам фиксированной длины, а бинарный поиск отвечает за переход от задачи проверки к задаче оптимизации.

---

## 7. Пример: максимальная длина подотрезка положительных чисел с суммой не больше $x$

Разберём эту схему на задаче, где хорошо видно и проверку, и монотонность. Пусть все элементы массива положительны, и нужно найти максимальную длину подотрезка, сумма которого не превосходит $x$.

Если бы длина $k$ была дана заранее, мы бы спрашивали только одно:

> существует ли подотрезок длины ровно $k$ с суммой не больше $x$?

И вот здесь снова появляется уже знакомое окно фиксированной длины. Этот вопрос можно проверить за $O(n)$:

- сначала считаем сумму первого окна;
- затем сдвигаем окно на один шаг;
- если хотя бы у одного окна сумма не больше $x$, то проверка успешна.

Теперь главный вопрос не про реализацию проверки, а про то, почему вообще здесь разрешено искать ответ бинарным поиском по $k$.

Потому что если существует подходящий подотрезок длины $k$, то у него есть и любой префикс длины меньше $k$, а сумма этого префикса тоже не превосходит $x$, так как все элементы положительны.

Значит:

- если длина $k$ подходит, то все меньшие длины тоже подходят;
- если длина $k$ не подходит, то все большие длины тоже не подходят.

Именно это и даёт монотонность для бинарного поиска.

Маленький фрагмент функции проверки на C++:

```cpp
bool check(const vector<int>& a, int k, long long x) {
    // Считаем сумму первого окна длины k.
    long long window_sum = 0;
    for (int i = 0; i < k; i++) {
        window_sum += a[i];
    }
    if (window_sum <= x) {
        return true;
    }

    for (int left = 0; left + k < (int)a.size(); left++) {
        // Переходим к следующему окну той же длины.
        window_sum -= a[left];
        window_sum += a[left + k];
        if (window_sum <= x) {
            return true;
        }
    }
    return false;
}
```

Тот же фрагмент на Python3:

```python
def check(a, k, x):
    # Считаем сумму первого окна длины k.
    window_sum = sum(a[:k])
    if window_sum <= x:
        return True

    for left in range(len(a) - k):
        # Переходим к следующему окну той же длины.
        window_sum -= a[left]
        window_sum += a[left + k]
        if window_sum <= x:
            return True
    return False
```

<details>
<summary><strong>Полная программа на C++</strong></summary>

```cpp
#include <iostream>
#include <vector>
using namespace std;

bool check(const vector<int>& a, int k, long long x) {
    if (k == 0) {
        return true;
    }

    long long window_sum = 0;
    // Считаем сумму первого окна длины k.
    for (int i = 0; i < k; i++) {
        window_sum += a[i];
    }
    if (window_sum <= x) {
        return true;
    }

    for (int left = 0; left + k < (int)a.size(); left++) {
        // Переходим к следующему окну той же длины.
        window_sum -= a[left];
        window_sum += a[left + k];
        if (window_sum <= x) {
            return true;
        }
    }
    return false;
}

int main() {
    int n;
    long long x;
    cin >> n >> x;
    vector<int> a(n);
    for (int i = 0; i < n; i++) {
        cin >> a[i];
    }

    int low = 0;
    int high = n + 1;
    // На полуинтервале [low, high): low подходит, high ещё не подходит.
    while (high - low > 1) {
        int mid = (low + high) / 2;
        if (check(a, mid, x)) {
            low = mid;
        } else {
            high = mid;
        }
    }

    cout << low << '\n';
}
```

</details>

<details>
<summary><strong>Полная программа на Python3</strong></summary>

```python
def check(a, k, x):
    if k == 0:
        return True

    # Считаем сумму первого окна длины k.
    window_sum = sum(a[:k])
    if window_sum <= x:
        return True

    for left in range(len(a) - k):
        # Переходим к следующему окну той же длины.
        window_sum -= a[left]
        window_sum += a[left + k]
        if window_sum <= x:
            return True
    return False


n, x = map(int, input().split())
a = list(map(int, input().split()))

low = 0
high = n + 1
# На полуинтервале [low, high): low подходит, high ещё не подходит.
while high - low > 1:
    mid = (low + high) // 2
    if check(a, mid, x):
        low = mid
    else:
        high = mid

print(low)
```

</details>

Файлы примера: [C++](examples/example-01.cpp), [Python3](examples/example-01.py).

<details>
<summary><strong>Пример ввода и вывода</strong></summary>

Для ввода

```text
7 11
2 5 1 2 3 6 2
```

получим вывод

```text
4
```

</details>

Такое решение работает за $O(n \log(n))$:

- одна проверка занимает $O(n)$;
- бинарный поиск делает $O(\log(n))$ проверок.

---

## 8. Когда эта схема полезна, а когда даёт лишний логарифм

> [!NOTE]
> На этом примере важно увидеть не только сам шаблон, но и его цену.

Схема “бинарный поиск по ответу + скользящее окно” полезна, когда:

- есть чёткая монотонность по длине;
- для фиксированной длины $k$ мы умеем быстро проверить все окна;
- прямого линейного решения не видно или оно сложнее в реализации.

Внутри такой проверки можно использовать не только сумму окна. Подойдут и другие характеристики:

- минимум или максимум в окне;
- количество различных значений;
- число элементов с нужным признаком;
- какая-то комбинация нескольких локально поддерживаемых величин.

> [!WARNING]
> Если прямое решение за $O(n)$ уже очевидно и вы его знаете, то по асимптотике оно лучше, чем решение за $O(n \log(n))$.
>
> Но на олимпиадах важна не только асимптотика. Решение через бинарный поиск по ответу часто проще придумать и быстрее написать: внешний цикл стандартный, а проверка для фиксированного $k$ нередко заметно проще исходной задачи.
>
> Поэтому в соревновании не нужно любой ценой дожимать линейное решение, если вариант с бинарным поиском уже надёжен, понятен и уверенно проходит в лимит.
>
> Когда ограничение по времени равно 2 секундам, разница между 30 мс и 300 мс обычно не играет роли. Гораздо важнее быстро и без ошибок сдать эту задачу и перейти к следующим.

Именно поэтому эту же задачу полезно решить ещё раз другим способом. В следующей части мы уберём бинарный поиск совсем и разрешим длине окна меняться по ходу работы.