#include <bits/stdc++.h>
using namespace std;
int main() {
    // пусть дипломов = x
    // тогда грамот = k * x (по условию)
    // суммарно не больше половины, то есть:
    // x + k * x <= n / 2 ==> 2*(k+1)*x <= n (неравенство 1)
    // в задаче надо вывести x, k*x, и (n-(k+1)*x)
    int64_t n, k;
    cin >> n >> k;
    // выражаем x из неравенства (1):
    // 2*(k+1)*x <= n ==> x <= (n / (2*(k+1)))
    int64_t x = n / ((2*(k+1)));
    std::cout << x << ' ' << k * x << ' ' << (n-(k+1)*x) << endl;
}