#include <bits/stdc++.h>
#define all(x) (x).begin(),(x).end()
using namespace std;
int32_t main() {
    // копируем увидительные числа из первого примера:
    set<int> a{1342176,364722,6,9,18,30,56,99,7710,27594,52377,99858,190557};
    a.insert({1,2,3,186,335,630,1161,2182,4080,14532,698870,2580795,4971008});
    // читаем числа из ввода и выкидываем их из множества:
    int n; cin >> n;
    while (n --> 0) {
        int x; cin >> x;
        a.erase(x);
    }
    // выводим ответ:
    cout << a.size() << '\n';
    for (auto &x : a)
        cout << x << ' ';
}
